In [74]:
import sqlite3

In [75]:
import pandas as pd

In [2]:
con = sqlite3.connect('collageduniya.db')

In [8]:
cur = con.cursor()

In [12]:
query = '''CREATE TABLE IF NOT EXISTS customer (CustomerID  integer PRIMARY KEY, CName varchar(20), City varchar(20),
Grade int,Salesman_id int)'''

In [13]:
cur.execute(query)

In [14]:
con.commit()

In [18]:
q = '''insert into customer values(3002, 'Shreya', 'Delhi', 100, 5001)'''

In [20]:
cur.execute(q)

In [21]:
con.commit()

In [25]:
q = '''insert into customer values(3007, 'Suresh', 'Delhi', 200, 5001)'''

cur.execute(q)

con.commit()

In [33]:
# 3005, 'Deeksha', 'Bangalore', 200, 5002
# 3008, 'Ragini', 'Mumbai', 300, 5002
# 3004, 'Anshul', 'Hyderabad', 300, 5006
# 3009, 'Tisha', 'Pune', 100, 5003

In [32]:
q = '''insert into customer values(3009, 'Tisha', 'Pune', 100, 5003)'''

cur.execute(q)

con.commit()

In [34]:
q = '''select * from customer'''

In [35]:
cur.execute(q)

In [36]:
cur.fetchall()

[(3002, 'Shreya', 'Delhi', 100, 5001),
 (3004, 'Anshul', 'Hyderabad', 300, 5006),
 (3005, 'Deeksha', 'Bangalore', 200, 5002),
 (3007, 'Suresh', 'Delhi', 200, 5001),
 (3008, 'Ragini', 'Mumbai', 300, 5002),
 (3009, 'Tisha', 'Pune', 100, 5003)]

In [37]:
query = '''CREATE TABLE IF NOT EXISTS Salesman (Salesman_id  integer PRIMARY KEY, SName  varchar(20), City varchar(20),
Commission varchar)'''

In [38]:
cur.execute(query)
con.commit()

In [ ]:
# 5002, 'Rahul', 'Bangalore', 0.15
# 5005, 'Manav', 'Hyderabad', 0.13
# 5006, 'Akash', 'Hyderabad', 0.11
# 5007, 'Riya', 'Delhi', 0.12
# 5003, 'Mayank', 'Pune', 0.13

In [43]:
q = '''insert into Salesman values(5003, 'Mayank', 'Pune', 0.13)'''

cur.execute(q)

con.commit()

In [44]:
q = '''select * from Salesman'''

cur.execute(q)

cur.fetchall()

[(5002, 'Rahul', 'Bangalore', '0.15'),
 (5003, 'Mayank', 'Pune', '0.13'),
 (5005, 'Manav', 'Hyderabad', '0.13'),
 (5006, 'Akash', 'Hyderabad', '0.11'),
 (5007, 'Riya', 'Delhi', '0.12')]

● From the following tables, write a SQL query to find the salespersons and
customers who live in the same city. Return customer name, salesperson
name and salesperson city.

In [79]:
q = '''select c.CName as CustomerName, s.SName as SalespersonName, s.City as City 
from customer AS c join Salesman AS s on c.Salesman_id=s.Salesman_id'''

In [80]:
cur.execute(q)
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  CustomerName SalespersonName       City
0       Anshul           Akash  Hyderabad
1      Deeksha           Rahul  Bangalore
2       Ragini           Rahul  Bangalore
3        Tisha          Mayank       Pune

● write a SQL query to find those salespeople who generated orders for their
customers but not located in the same city. Return salesman_name,
commission, cust_name, customer_id & salesman_id.

In [86]:
q  = '''select s.SName as salesman_name, s.Commission as Commission, c.CName, s.Salesman_id as Salesman_id 
from Salesman as s join customer as c on c.Salesman_id=s.Salesman_id where s.City <> c.City'''

In [89]:
cur.execute(q)
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  salesman_name Commission   CName  Salesman_id
0         Rahul       0.15  Ragini         5002

Create a view tagging which customers are handled by which sales
person. Display Customer name, Salesman name

In [122]:

q = '''CREATE VIEW tagging As select c.CName as CustomerName from customer AS c left join Salesman AS s on c.Salesman_id=s.Salesman_id
union all select s.SName as SalespersonName from Salesman AS s
'''

In [124]:
# cur.execute(q)
# headers = list(map(lambda attr : attr[0], cur.description))
# results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
# opt = pd.DataFrame(results)
# cur.description
# # cur.fetchall()
# opt

Extract the leading two accounts having the highest total distinctive
customers based on every month.

In [125]:
query = '''CREATE TABLE IF NOT EXISTS Customers (Account ID   integer, Date  DATE, Customer ID integer)'''

cur.execute(query)
con.commit()

In [148]:
# 1, '2022-01-02', 10
# 1, '2022-01-27', 20
# 2, '2022-01-01', 30
# 2, '2022-01-21', 40
# 2, '2022-01-21', 30
# 2, '2022-01-01', 50
# 3, '2022-01-20', 40
# 1, '2022-01-04', 50
# 3, '2022-01-20', 45

In [146]:
q = '''insert into Customers values(3, '2022-01-20', 45)'''

cur.execute(q)

con.commit()

In [147]:
# cur.execute('delete from  Customers')
# con.commit()
cur.execute('select * from Customers')
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

   Account        Date  Customer
0        1  2022-01-02        10
1        1  2022-01-27        20
2        2  2022-01-01        30
3        2  2022-01-21        40
4        2  2022-01-21        30
5        2  2022-01-01        50
6        3  2022-01-20        40
7        1  2022-01-04        50
8        3  2022-01-20        45

In [187]:
q = '''select Account as Account_ID, count(DISTINCT Customer) as Customer_Count from Customers group by Account limit 2'''

cur.execute(q)

con.commit()

In [188]:
# cur.execute('delete from  Customers')
# con.commit()
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

   Account_ID  Customer_Count
0           1               3
1           2               3

3. Write an SQL query to display:
● Employee having the highest salary
● Department having the highest total salary
● Employees who either earn the highest salary or the lowest salary in
each department from the employee table.

In [189]:
query = '''CREATE TABLE IF NOT EXISTS EMPLOYEE (emp_id integer Primary Key, emp_name  varchar, dept_name varchar, salary iniger)'''

cur.execute(query)
con.commit()

In [ ]:
11 'A' 'Admin' 2000

In [220]:
q = '''insert into EMPLOYEE values(234, 'X', 'IT', 11000)'''

cur.execute(q)

con.commit()

In [221]:
# cur.execute('delete from  Customers')
# con.commit()
cur.execute('select * from EMPLOYEE')
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

    emp_id emp_name dept_name salary
0       11        A     Admin   2000
1       14        B     Admin   4000
2       15        C     Admin   4000
3       17        I        HR   3000
4       23        E   Finance   5500
5       45        G   Finance   6500
6       49        P        IT   4500
7       65        D     Admin   5000
8       76        E   Finance   5000
9       87        J        HR   3000
10      90        Q        IT   6000
11      93        O        IT   4000
12     213        U        IT   8000
13     234        X        IT  11000
14     342        W        IT  10000

In [238]:
q = '''select MAX(salary), emp_name from EMPLOYEE'''
cur.execute(q)

con.commit()

In [239]:
# cur.execute('delete from  Customers')
# con.commit()
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  MAX(salary) emp_name
0        8000        U

In [240]:
q = '''select MAX(salary), dept_name from EMPLOYEE'''
cur.execute(q)

con.commit()
cur.fetchall()

[('8000', 'IT')]

In [262]:
q = '''select emp_name, max(salary), dept_name from EMPLOYEE group by dept_name'''

cur.execute(q)

con.commit()

In [263]:
# cur.execute('delete from  Customers')
# con.commit()
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  emp_name max(salary) dept_name
0        D        5000     Admin
1        G        6500   Finance
2        I        3000        HR
3        U        8000        IT

In [266]:
q = '''select emp_name, min(salary), dept_name from EMPLOYEE group by dept_name'''

cur.execute(q)

con.commit()

In [267]:
# cur.execute('delete from  Customers')
# con.commit()
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  emp_name min(salary) dept_name
0        A        2000     Admin
1        E        5000   Finance
2        I        3000        HR
3        W       10000        IT

In [274]:
q = '''select emp_name, min(salary) as min %testr%, dept_name from EMPLOYEE group by dept_name'''

cur.execute(q)

con.commit()

OperationalError: near "%": syntax error

In [271]:
# cur.execute('delete from  Customers')
# con.commit()
headers = list(map(lambda attr : attr[0], cur.description))
results = [{header:row[i] for i, header in enumerate(headers)} for row in cur]
opt = pd.DataFrame(results)
cur.description
# cur.fetchall()
opt

  emp_name  testr dept_name
0        A   2000     Admin
1        E   5000   Finance
2        I   3000        HR
3        W  10000        IT